{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 20, 494, 1], "dtype": "float32", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [8, 10], "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d", "filters": 64, "padding": "same", "use_bias": true}, "name": "conv2d", "inbound_nodes": [["input_1", 0, 0, {}]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d"}, "name": "max_pooling2d", "inbound_nodes": [["conv2d", 0, 0, {}]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [4, 10], "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_1", "filters": 32, "padding": "same", "use_bias": true}, "name": "conv2d_1", "inbound_nodes": [["max_pooling2d", 0, 0, {}]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_1"}, "name": "max_pooling2d_1", "inbound_nodes": [["conv2d_1", 0, 0, {}]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [2, 5], "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_2", "filters": 64, "padding": "same", "use_bias": true}, "name": "conv2d_2", "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_2"}, "name": "max_pooling2d_2", "inbound_nodes": [["conv2d_2", 0, 0, {}]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_3", "filters": 32, "padding": "same", "use_bias": true}, "name": "conv2d_3", "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "padding": "same", "pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_3"}, "name": "max_pooling2d_3", "inbound_nodes": [["conv2d_3", 0, 0, {}]]}, {"class_name": "Flatten", "config": {"name": "flatten", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]]}, {"class_name": "Dense", "config": {"units": 512, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "relu", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [["flatten", 0, 0, {}]]}, {"class_name": "Dense", "config": {"units": 2, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "dense"}, "name": "dense", "inbound_nodes": [["flatten", 0, 0, {}]]}, {"class_name": "Dense", "config": {"units": 10, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_regularizer": null, "activation": "softmax", "kernel_constraint": null, "dtype": "float32", "use_bias": true, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [["dense_1", 0, 0, {}]]}], "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]], "name": "model", "input_layers": ["input_1", 0, 0]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}