{"backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense", 0, 0], ["dense_2", 0, 0]], "name": "model", "input_layers": ["input_1", 0, 0], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 20, 494, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d", "kernel_size": [8, 10], "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "relu", "filters": 64}, "inbound_nodes": [["input_1", 0, 0, {}]], "name": "conv2d"}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [["conv2d", 0, 0, {}]], "name": "max_pooling2d"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_1", "kernel_size": [4, 10], "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "relu", "filters": 32}, "inbound_nodes": [["max_pooling2d", 0, 0, {}]], "name": "conv2d_1"}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [["conv2d_1", 0, 0, {}]], "name": "max_pooling2d_1"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_2", "kernel_size": [2, 5], "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "relu", "filters": 64}, "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "name": "conv2d_2"}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [["conv2d_2", 0, 0, {}]], "name": "max_pooling2d_2"}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "conv2d_3", "kernel_size": [1, 1], "dtype": "float32", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "padding": "same", "strides": [1, 1], "activation": "relu", "filters": 64}, "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "name": "conv2d_3"}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "padding": "same", "strides": [2, 2], "pool_size": [2, 2]}, "inbound_nodes": [["conv2d_3", 0, 0, {}]], "name": "max_pooling2d_3"}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "name": "flatten", "data_format": "channels_last"}, "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "name": "flatten"}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "relu", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 128}, "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense_1"}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 2}, "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense"}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "activation": "softmax", "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "trainable": true, "units": 10}, "inbound_nodes": [["dense_1", 0, 0, {}]], "name": "dense_2"}]}, "keras_version": "2.2.4-tf"}