{"backend": "tensorflow", "config": {"name": "model", "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20, 494, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"name": "conv2d", "inbound_nodes": [["input_1", 0, 0, {}]], "config": {"dilation_rate": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_size": [8, 10], "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"name": "max_pooling2d", "inbound_nodes": [["conv2d", 0, 0, {}]], "config": {"pool_size": [2, 2], "name": "max_pooling2d", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_1", "inbound_nodes": [["max_pooling2d", 0, 0, {}]], "config": {"dilation_rate": [1, 1], "filters": 128, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_1", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_size": [4, 10], "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_1", "inbound_nodes": [["conv2d_1", 0, 0, {}]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_2", "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "config": {"dilation_rate": [1, 1], "filters": 64, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_2", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_size": [2, 5], "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_2", "inbound_nodes": [["conv2d_2", 0, 0, {}]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"name": "conv2d_3", "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "config": {"dilation_rate": [1, 1], "filters": 32, "activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "conv2d_3", "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_size": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Conv2D"}, {"name": "max_pooling2d_3", "inbound_nodes": [["conv2d_3", 0, 0, {}]], "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"name": "flatten", "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "config": {"name": "flatten", "data_format": "channels_last", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"name": "dense_1", "inbound_nodes": [["flatten", 0, 0, {}]], "config": {"activation": "relu", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "units": 32, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Dense"}, {"name": "dense", "inbound_nodes": [["flatten", 0, 0, {}]], "config": {"activation": "softmax", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense", "kernel_regularizer": null, "kernel_constraint": null, "units": 2, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Dense"}, {"name": "dense_2", "inbound_nodes": [["dense_1", 0, 0, {}]], "config": {"activation": "softmax", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "units": 10, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32"}, "class_name": "Dense"}], "input_layers": ["input_1", 0, 0]}, "class_name": "Model", "keras_version": "2.2.4-tf"}