{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4-tf", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 20, 494, 1], "dtype": "float32", "sparse": false}}, {"inbound_nodes": [["input_1", 0, 0, {}]], "name": "conv2d", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [8, 10], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d", "bias_regularizer": null, "filters": 64, "padding": "same", "activation": "relu"}}, {"inbound_nodes": [["conv2d", 0, 0, {}]], "name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d", "padding": "same", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [["max_pooling2d", 0, 0, {}]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [4, 10], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "filters": 128, "padding": "same", "activation": "relu"}}, {"inbound_nodes": [["conv2d_1", 0, 0, {}]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [2, 5], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "filters": 64, "padding": "same", "activation": "relu"}}, {"inbound_nodes": [["conv2d_2", 0, 0, {}]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "name": "conv2d_3", "bias_regularizer": null, "filters": 32, "padding": "same", "activation": "relu"}}, {"inbound_nodes": [["conv2d_3", 0, 0, {}]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last", "dtype": "float32", "pool_size": [2, 2], "trainable": true}}, {"inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "name": "flatten", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten", "dtype": "float32", "trainable": true}}, {"inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense_1", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_regularizer": null, "trainable": true, "activation": "relu", "units": 256, "bias_regularizer": null, "kernel_constraint": null}}, {"inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "dtype": "float32", "name": "dense", "kernel_regularizer": null, "trainable": true, "activation": "softmax", "units": 2, "bias_regularizer": null, "kernel_constraint": null}}, {"inbound_nodes": [["dense_1", 0, 0, {}]], "name": "dense_2", "class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "activity_regularizer": null, "dtype": "float32", "name": "dense_2", "kernel_regularizer": null, "trainable": true, "activation": "softmax", "units": 10, "bias_regularizer": null, "kernel_constraint": null}}], "input_layers": ["input_1", 0, 0], "name": "model", "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]]}}