{"config": {"output_layers": [["dense", 0, 0], ["dense_2", 0, 0]], "layers": [{"config": {"sparse": false, "dtype": "float32", "name": "input_1", "batch_input_shape": [null, 20, 494, 1]}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d", "kernel_size": [8, 10], "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d", "inbound_nodes": [["input_1", 0, 0, {}]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "name": "max_pooling2d", "inbound_nodes": [["conv2d", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_1", "kernel_size": [4, 10], "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [["max_pooling2d", 0, 0, {}]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [["conv2d_1", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_2", "kernel_size": [2, 5], "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [["conv2d_2", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "conv2d_3", "kernel_size": [1, 1], "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dilation_rate": [1, 1], "filters": 32, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "bias_constraint": null, "padding": "same", "bias_regularizer": null}, "class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]]}, {"config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "dtype": "float32", "data_format": "channels_last", "strides": [2, 2], "padding": "same"}, "class_name": "MaxPooling2D", "name": "max_pooling2d_3", "inbound_nodes": [["conv2d_3", 0, 0, {}]]}, {"config": {"trainable": true, "dtype": "float32", "data_format": "channels_last", "name": "flatten"}, "class_name": "Flatten", "name": "flatten", "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "relu", "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "units": 256, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "name": "dense_1", "inbound_nodes": [["flatten", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "name": "dense", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "units": 2, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "name": "dense", "inbound_nodes": [["flatten", 0, 0, {}]]}, {"config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "activity_regularizer": null, "units": 10, "bias_constraint": null, "bias_regularizer": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [["dense_1", 0, 0, {}]]}], "input_layers": ["input_1", 0, 0], "name": "model"}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4-tf"}