{"keras_version": "2.2.4-tf", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 20, 494, 1]}, "inbound_nodes": []}, {"name": "conv2d", "class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "same", "dtype": "float32", "filters": 64, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_size": [8, 10], "bias_regularizer": null, "name": "conv2d", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [["input_1", 0, 0, {}]]}, {"name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "dtype": "float32", "name": "max_pooling2d", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [["conv2d", 0, 0, {}]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "same", "dtype": "float32", "filters": 64, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_size": [4, 10], "bias_regularizer": null, "name": "conv2d_1", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [["max_pooling2d", 0, 0, {}]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "dtype": "float32", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [["conv2d_1", 0, 0, {}]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "same", "dtype": "float32", "filters": 32, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_size": [2, 5], "bias_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "dtype": "float32", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [["conv2d_2", 0, 0, {}]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"activity_regularizer": null, "trainable": true, "padding": "same", "dtype": "float32", "filters": 32, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "trainable": true, "padding": "same", "dtype": "float32", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [["conv2d_3", 0, 0, {}]]}, {"name": "flatten", "class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten", "dtype": "float32", "trainable": true}, "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]]}, {"name": "dense_1", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 64, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu"}, "inbound_nodes": [["flatten", 0, 0, {}]]}, {"name": "dense", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 2, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax"}, "inbound_nodes": [["flatten", 0, 0, {}]]}, {"name": "dense_2", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "dtype": "float32", "units": 10, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_constraint": null, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax"}, "inbound_nodes": [["dense_1", 0, 0, {}]]}], "name": "model", "input_layers": ["input_1", 0, 0], "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}