{"backend": "tensorflow", "keras_version": "2.2.4-tf", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 20, 494, 1], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [["input_1", 0, 0, {}]], "name": "conv2d", "config": {"bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [8, 10], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "padding": "same", "filters": 64, "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [["conv2d", 0, 0, {}]], "name": "max_pooling2d", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d", "dtype": "float32", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [["max_pooling2d", 0, 0, {}]], "name": "conv2d_1", "config": {"bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [4, 10], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "padding": "same", "filters": 128, "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_1", 0, 0, {}]], "name": "max_pooling2d_1", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "name": "conv2d_2", "config": {"bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_2", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [2, 5], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "padding": "same", "filters": 64, "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_2", 0, 0, {}]], "name": "max_pooling2d_2", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "padding": "same"}}, {"class_name": "Conv2D", "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "name": "conv2d_3", "config": {"bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "name": "conv2d_3", "activity_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "padding": "same", "filters": 32, "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_3", 0, 0, {}]], "name": "max_pooling2d_3", "config": {"pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "dtype": "float32", "trainable": true, "padding": "same"}}, {"class_name": "Flatten", "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "name": "flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense_1", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "units": 256, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense", "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "units": 2, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [["dense_1", 0, 0, {}]], "name": "dense_2", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "activity_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "units": 10, "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "use_bias": true, "trainable": true}}], "name": "model", "input_layers": ["input_1", 0, 0], "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]]}}