{"config": {"layers": [{"config": {"batch_input_shape": [null, 20, 494, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d", "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [8, 10], "use_bias": true, "data_format": "channels_last", "padding": "same", "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [["input_1", 0, 0, {}]], "name": "conv2d"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d", "dtype": "float32", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [["conv2d", 0, 0, {}]], "name": "max_pooling2d"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [4, 10], "use_bias": true, "data_format": "channels_last", "padding": "same", "filters": 128, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [["max_pooling2d", 0, 0, {}]], "name": "conv2d_1"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "dtype": "float32", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_1", 0, 0, {}]], "name": "max_pooling2d_1"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [2, 5], "use_bias": true, "data_format": "channels_last", "padding": "same", "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "name": "conv2d_2"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "dtype": "float32", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_2", 0, 0, {}]], "name": "max_pooling2d_2"}, {"config": {"dilation_rate": [1, 1], "kernel_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "strides": [1, 1], "kernel_size": [1, 1], "use_bias": true, "data_format": "channels_last", "padding": "same", "filters": 64, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Conv2D", "inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "name": "conv2d_3"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "dtype": "float32", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D", "inbound_nodes": [["conv2d_3", 0, 0, {}]], "name": "max_pooling2d_3"}, {"config": {"trainable": true, "name": "flatten", "dtype": "float32", "data_format": "channels_last"}, "class_name": "Flatten", "inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "name": "flatten"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense_1", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 256, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense", "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense_1"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 2, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense", "inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense"}, {"config": {"bias_constraint": null, "kernel_regularizer": null, "name": "dense_2", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 10, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense", "inbound_nodes": [["dense_1", 0, 0, {}]], "name": "dense_2"}], "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]], "input_layers": ["input_1", 0, 0], "name": "model"}, "keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow"}