{"keras_version": "2.2.4-tf", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 20, 494, 1], "name": "input_1", "sparse": false, "dtype": "float32"}}, {"inbound_nodes": [["input_1", 0, 0, {}]], "name": "conv2d", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "name": "conv2d", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "filters": 128, "kernel_size": [8, 10], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [["conv2d", 0, 0, {}]], "name": "max_pooling2d", "class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d", "dtype": "float32", "strides": [2, 2]}}, {"inbound_nodes": [["max_pooling2d", 0, 0, {}]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "name": "conv2d_1", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "filters": 64, "kernel_size": [4, 10], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [["conv2d_1", 0, 0, {}]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1", "dtype": "float32", "strides": [2, 2]}}, {"inbound_nodes": [["max_pooling2d_1", 0, 0, {}]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "name": "conv2d_2", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "filters": 64, "kernel_size": [2, 5], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [["conv2d_2", 0, 0, {}]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2", "dtype": "float32", "strides": [2, 2]}}, {"inbound_nodes": [["max_pooling2d_2", 0, 0, {}]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "name": "conv2d_3", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "data_format": "channels_last", "activation": "relu", "filters": 32, "kernel_size": [1, 1], "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1]}}, {"inbound_nodes": [["conv2d_3", 0, 0, {}]], "name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3", "dtype": "float32", "strides": [2, 2]}}, {"inbound_nodes": [["max_pooling2d_3", 0, 0, {}]], "name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "dtype": "float32", "data_format": "channels_last", "trainable": true}}, {"inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense_1", "class_name": "Dense", "config": {"kernel_constraint": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "activation": "relu", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_1", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [["flatten", 0, 0, {}]], "name": "dense", "class_name": "Dense", "config": {"kernel_constraint": null, "units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "activation": "softmax", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense", "activity_regularizer": null, "bias_constraint": null}}, {"inbound_nodes": [["dense_1", 0, 0, {}]], "name": "dense_2", "class_name": "Dense", "config": {"kernel_constraint": null, "units": 10, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "activation": "softmax", "dtype": "float32", "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "name": "dense_2", "activity_regularizer": null, "bias_constraint": null}}], "input_layers": ["input_1", 0, 0], "output_layers": [["dense", 0, 0], ["dense_2", 0, 0]]}}